### Pandas

* Data structures with labeled axes supporting automatic or explicit data alignment.This prevents common errors resulting from misaligned data and working with differently-indexed data coming from different sources.
* Integrated time series functionality.
* The same data structures handle both time series data and non-time series data.
* Arithmetic operations and reductions (like summing across an axis) would pass on the metadata (axis labels).
* Flexible handling of missing data.
* Merge and other relational operations found in popular database databases (SQLbased, for example).

In [144]:
from pandas import Series, DataFrame

In [145]:
import pandas as pd

In [146]:
import numpy as np

#### Series

A Series is a one-dimensional array-like object containing an array of data (of any NumPy data type) and an associated array of data labels, called its index.

In [147]:
obj = Series([4, 7, -5, 3])

In [148]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [149]:
obj.values

array([ 4,  7, -5,  3])

In [150]:
obj.index

RangeIndex(start=0, stop=4, step=1)

a Series with an index identifying each data point:

In [151]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [152]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [153]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [154]:
obj2['a']

-5

In [155]:
obj2['d']

4

In [156]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [157]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [158]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [159]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

**if you have data contained in a Python dict, you can create a Series from it by passing the dict:**

In [160]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [161]:
sdata

{'Ohio': 35000, 'Oregon': 16000, 'Texas': 71000, 'Utah': 5000}

In [162]:
obj3 = Series(sdata)

In [163]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [164]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [165]:
obj4 = Series(sdata, index=states)

In [166]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

since no value for `'California'` was found, it appears as NaN (not a number) which is considered in pandas to mark missing or _NA_ values.

In [167]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [168]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [169]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [170]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Both the Series object itself and its index have a `name` attribute, which integrates with other key areas of pandas functionality:

In [171]:
obj4.name = 'population'

In [172]:
obj4.index.name = 'state'

In [173]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [174]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [175]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dict of Series (one for all sharing the same index).

from a dict of equal-length lists:

In [176]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [177]:
frame = DataFrame(data)

In [178]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [179]:
#changing the sequence of columns
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [180]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])

In [181]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [182]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [183]:
frame2['state'] #dict-like notation (I)

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [184]:
frame2.year #attribute (II)

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

Rows can also be retrieved by position or name by a couple of methods, such as the `ix` indexing field

In [185]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [186]:
frame2['debt'] = 16.5

In [187]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [188]:
frame2['debt'] = np.arange(5.)

In [189]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [190]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [191]:
frame2['debt'] =val

In [192]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

Assigning a column that doesnâ€™t exist will create a new column. The `del` keyword will delete columns as with a dict:

In [193]:
frame2['eastern'] = frame2.state == 'Ohio'

In [194]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [195]:
del frame2['eastern']

In [196]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

Another common form of data is a nested dict of dicts format:

In [197]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
....: 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [198]:
frame3 = DataFrame(pop)

In [199]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [200]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [201]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [202]:
pdata = {'Ohio': frame3['Ohio'][:-1],
....: 'Nevada': frame3['Nevada'][:2]}

In [203]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [204]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [205]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [206]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [207]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### ReIndexing

In [208]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [209]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [210]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [211]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [212]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [213]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
....: columns=['Ohio', 'Texas', 'California'])

In [214]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [215]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [216]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [217]:
states = ['Texas', 'Utah', 'California']

In [218]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [219]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
....: columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping

In [220]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [221]:
new_obj = obj.drop('c')

In [222]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [223]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [224]:
data = DataFrame(np.arange(16).reshape((4, 4)),
....: index=['Ohio', 'Colorado', 'Utah', 'New York'],
....: columns=['one', 'two', 'three', 'four'])

In [225]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [226]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [227]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [228]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [229]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [230]:
obj['b'] # is equal to obj[1]

1.0

In [231]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [232]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [233]:
obj['b':'c'] = 5

In [234]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [235]:
data = DataFrame(np.arange(16).reshape((4, 4)),
.....: index=['Ohio', 'Colorado', 'Utah', 'New York'],
.....: columns=['one', 'two', 'three', 'four'])

In [236]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [237]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [238]:
data [:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [239]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

For DataFrame label-indexing on the rows, we have the special indexing field `ix`. It enables you to select a subset of the rows and columns from a DataFrame with NumPylike notation plus axis labels.

In [240]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [241]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [242]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [243]:
data.ix[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int64

In [244]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [245]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [246]:
s1,s2

(a    7.3
 c   -2.5
 d    3.4
 e    1.5
 dtype: float64, a   -2.1
 c    3.6
 e   -1.5
 f    4.0
 g    3.1
 dtype: float64)

In [247]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [248]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
.....: index=['Ohio', 'Texas', 'Colorado'])

In [249]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
.....: index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [250]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [251]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [252]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [253]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [254]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [255]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [256]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [257]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [258]:
df1.add(df2, fill_value=0) #fill for NAs

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

### Operations between DataFrame and Series

In [259]:
arr = np.arange(12.).reshape((3, 4))

In [260]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [261]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [262]:
arr-arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

This is referred to as broadcasting

In [263]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
.....: index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [264]:
series = frame.ix[0]

In [265]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [266]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [267]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [268]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

broadcasting over the columns

In [269]:
series3 = frame['d']

In [270]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

#### NumPy ufuncs (element-wise array methods) work fine with pandas objects:

In [271]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
.....: index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [272]:
frame

               b         d         e
Utah   -0.070886 -1.143034 -1.151177
Ohio   -0.878472  0.192994  1.330821
Texas  -0.411062 -1.225519 -0.099396
Oregon  0.673948 -1.801684 -2.836009

In [273]:
np.abs(frame)

               b         d         e
Utah    0.070886  1.143034  1.151177
Ohio    0.878472  0.192994  1.330821
Texas   0.411062  1.225519  0.099396
Oregon  0.673948  1.801684  2.836009

**Another frequent operation is applying a function on 1D arrays to each column or row. DataFrameâ€™s apply method does exactly this:**

In [274]:
f = lambda x: x.max() - x.min()

In [275]:
frame.apply(f)

b    1.552420
d    1.994678
e    4.166830
dtype: float64

In [276]:
frame.apply(f, axis=1)

Utah      1.080290
Ohio      2.209293
Texas     1.126122
Oregon    3.509957
dtype: float64

The function passed to apply need not return a scalar value, it can also return a Series with multiple values:

In [277]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [278]:
frame.apply(f)

            b         d         e
min -0.878472 -1.801684 -2.836009
max  0.673948  0.192994  1.330821

We use `applymap` for doing Element-wise python operations on `frame`s, consider that for `Series` we have a `map` function which exactly does the same:

In [279]:
format = lambda x: '%.2f' % x

In [280]:
frame.applymap(format)

            b      d      e
Utah    -0.07  -1.14  -1.15
Ohio    -0.88   0.19   1.33
Texas   -0.41  -1.23  -0.10
Oregon   0.67  -1.80  -2.84

In [281]:
frame['e'].map(format)

Utah      -1.15
Ohio       1.33
Texas     -0.10
Oregon    -2.84
Name: e, dtype: object

### Sorting and Ranking

sort lexicographically by row or column index:

In [282]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [283]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [284]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [286]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
         columns=['d', 'a', 'b', 'c'])

In [287]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [288]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [289]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [290]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

Sort by value:

In [291]:
obj = Series([4, 7, -3, 2])

In [293]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [294]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [295]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [296]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [297]:
frame #frame sorts dict based on the columns automaticaly

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [299]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [301]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

`Ranking` is closely related to sorting, assigning ranks from one through the number of valid data points in an array. It is similar to the indirect sort indices produced by `numpy.argsort`, except that ties are broken according to a rule. The rank methods for
Series and DataFrame are the place to look; by default rank breaks ties by assigning each group the mean rank:

In [302]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [303]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [304]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [305]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [306]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
.....: 'c': [-2, 5, 8, -2.5]})

In [307]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [308]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0